Catalogs/УсловияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>УсловияНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Позиция меню</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миниатюра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УсловияНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	// Наследуемые реквизиты.
	РодительПриИзмененииСервер();

КонецПроцедуры // РодительПриИзменении()

&НаСервере
Процедура РодительПриИзмененииСервер()
	
	__РаботаСДаннымиКлиентСервер.ПолучитьНаследуемыеРеквизиты(Объект);

КонецПроцедуры // РодительПриИзмененииСервер()

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	// Наименование.
	Объект.Наименование = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеНаименование(Объект.Номенклатура);
	
	// Изображения.
	НоменклатураПриИзмененииСервер();

КонецПроцедуры // НоменклатураПриИзменении()

&НаСервере
Процедура НоменклатураПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		ЗначениеВРеквизитФормы(Объект.Номенклатура.ПолучитьОбъект(), "Номенклатура");
	Иначе
		ЗначениеВРеквизитФормы(Новый (Тип("СправочникОбъект.Номенклатура")), "Номенклатура");
	КонецЕсли; 

КонецПроцедуры // НоменклатураПриИзмененииСервер()

&НаКлиенте
Процедура НоменклатураОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // НоменклатураОчистка()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Изображения.
	НоменклатураПриИзмененииСервер();

КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Связанные данные.
	__РаботаСДаннымиКлиентСервер.УстановитьСвязанныеДанные(
		Номенклатура.Ссылка, 
		Новый Структура("Изображение,Миниатюра,Иконка, Комментарий",
			Номенклатура.Изображение,
			Номенклатура.Миниатюра,
			Номенклатура.Иконка,
			Номенклатура.Комментарий),
		Отказ);
		
КонецПроцедуры // ПриЗаписиНаСервере()
